% 问题二 2.1 通过绕射计算
clc
%% 情况一--刃单峰
TR =  8.3420e+06;      % 收发信机之间的距离
h = 1000 ;            % 山峰高度
d1 = TR/2;          % 发信机到山峰之间的距离 
d2 = TR - d1;
c = 3*10^8;
global f;           % 工作频率
lamda = c/f;
v = h*sqrt(2/lamda*(1/d1+1/d2));
jv1 = 6.9+20*log(sqrt((v-0.1)^2+1)+v-0.1)     %衰减

%% 情况二-- 单圆形峰
R = 450;        % 半径
m = R*(d1+d2)/(d1*d2)/(pi*R/lamda)^(1/3);
n = h*(pi*R/lamda)^(2/3)/R;
k = 8.2+12*n;
b = 0.73+0.27*(1-exp(-1.43*n));
T= k*m*b;
jv2 = jv1*T

%% 情况三--双峰绕射
a = TR/3;
b = a;
c = a;
h1 = 1000;
v = h1*sqrt(2/lamda*(1/a+1/(b+c)));
jv31 = 6.9+20*log(sqrt((v-0.1)^2+1)+v-0.1)     %左峰衰减

h2 = 1000   ;
v = h2*sqrt(2/lamda*(1/(a+b)+1/c));
jv32 = 6.9+20*log(sqrt((v-0.1)^2+1)+v-0.1)     %右衰减

jv33 =  10*log((a+b)*(b+c)/(b*(a+b+c)))     % 修正因子

jv3 = jv31+jv32+jv33










