% Logistic回归分析
% 在回归分析中，如果y定量的变量，这时用regress函数对y进行回归即可
% 如果y是定性的变量，比如y=0或者1，那么就不能用regress函数对其进行回归而是采用Logistic回归

% 程序2-1： logistic方法Matlab实现程序
%--------------------------------------------------------------------------
%% 数据准备
clear all
clc
X0=xlsread('Ch3_logistic_ex1.xlsx', 'A2:C21'); % 回归数据X值
XE=xlsread('Ch3_logistic_ex1.xlsx', 'A2:C26'); % 验证与预测数据
Y0=xlsread('Ch3_logistic_ex1.xlsx', 'D2:D21'); % 回归数据P值
%--------------------------------------------------------------------------
%% 数据转化和参数回归
n=size(Y0,1);
for i=1:n
    if Y0(i)==0
        Y1(i,1)=0.25;
    else
        Y1(i,1)=0.75;
    end
end
X1=ones(size(X0,1),1); % 构建常数项系数
X=[X1, X0];
Y=log(Y1./(1-Y1));
b=regress(Y,X);
XE = [ones(size(XE,1),1), XE];
%--------------------------------------------------------------------------
%% 模型验证和应用
for i=1:size(XE,1)  
    Pai0 = exp(XE(i,:)*b)/(1+exp(XE(i,:)*b));
    if Pai0<=0.5
       P(i)=0;
    else 
       P(i)=1;
    end
end
%--------------------------------------------------------------------------
%% 显示结果
disp(['回归系数:' num2str(b')]);
disp(['评价结果:' num2str(P)]);


